app/controllers/comment_controller.rb

  def index
    authorize! @auth
    @comments = Comment.all
---
SELECT `comments`.* FROM `comments`

  def destroy
    authorize! @auth
    @comment = Comment.find(params[:id])


    @usr = User.find(@comment.usersid)
    @usr.commentedid = ("#" + @usr.commentedid).gsub("#"+params[:id].to_s+"#", "#")
    @usr.commentedid.slice!(0)
    @usr.save

    @comment.destroy
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 2 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `commentedid` = '3#', `updated_at` = '2017-05-22 20:55:22' WHERE `users`.`id` = 1
DELETE FROM `comments` WHERE `comments`.`id` = 2