app/controllers/courses_controller.rb

  def comm
    unless params[:comment][:message].blank? then
      ccc = Comment.new
      ccc.courseid = params[:id].to_i
      ccc.usersid = current_user.id
      ccc.message = params[:comment][:message]
      ccc.year = params[:comment][:year]
      ccc.typos = params[:comment][:typos]
      ccc.bycommented = Course.find(params[:id]).pv.to_i

      ccc.save


      @usrs = User.find(current_user.id)
      @usrs.commentedclass = @usrs.commentedclass.to_s + params[:id] + '#'
      @usrs.commentedid = @usrs.commentedid.to_s  + Comment.count.to_s + '#'
---
SELECT COUNT(*) FROM `comments`

  def create
    @course = Course.new(course_params)
    @course.creator = current_user.id
    respond_to do |format|
      if @course.save
        @usrs = User.find(current_user.id)
        @usrs.createdclass = @usrs.createdclass.to_s + Course.count.to_s+ '#'
---
SELECT COUNT(*) FROM `courses`