app/controllers/courses_controller.rb

SELECT `courses`.* FROM `courses`
---
  def index
    authorize! @auth
    @courses = Course.all

UPDATE `courses` SET `pv` = 1, `updated_at` = '2017-05-22 18:40:37' WHERE `courses`.`id` = 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `ratings` (`courseid`, `created_at`, `updated_at`) VALUES (1, '2017-05-22 18:40:37', '2017-05-22 18:40:37')
SELECT  `ratings`.* FROM `ratings` WHERE `ratings`.`courseid` = 1 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`courseid` = 1
---
  def show

    @course.pv +=1
    @course.save
    @usrs = User.find(current_user.id)
    @charts = Rating.find_or_create_by(courseid: params[:id])
    @comments = Comment.new
    @mess = Comment.where(courseid: params[:id])

SELECT  `ratings`.* FROM `ratings` WHERE `ratings`.`courseid` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `ratings` SET `vote` = 1, `teacher` = 1, `courserate` = 2, `easy` = 3, `attendance` = 2, `homework` = 5, `updated_at` = '2017-05-23 08:14:20' WHERE `ratings`.`id` = 1
UPDATE `users` SET `ratedclass` = '1#', `updated_at` = '2017-05-23 08:14:20' WHERE `users`.`id` = 1
---
  def rate
    @ratings = Rating.find_or_create_by(courseid: params[:id])
    @ratings.vote +=1
    @ratings.teacher += params[:rating][:teacher].to_i
    @ratings.courserate += params[:rating][:courserate].to_i
    @ratings.easy += params[:rating][:easy].to_i
    @ratings.attendance += params[:rating][:attendance].to_i
    @ratings.homework += params[:rating][:homework].to_i


    @usrs = User.find(current_user.id)
    unless @usrs.ratedclass.blank?
      @ratedornot = @usrs.ratedclass.split("#").find{ |ids| ids.to_i ==   params[:id].to_i }
    end
    @usrs.ratedclass = @usrs.ratedclass.to_s + params[:id]  + '#'

    if @ratedornot.blank? then
      @ratings.save
      @usrs.save

SELECT  `comments`.* FROM `comments`  ORDER BY `comments`.`id` DESC LIMIT 1
SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `comments` (`courseid`, `usersid`, `message`, `year`, `typos`, `bycommented`, `created_at`, `updated_at`) VALUES (1, 1, 'effeeeeeeeeeeeeeeeeee', 2016, 2, 6, '2017-05-22 20:43:56', '2017-05-22 20:43:56')
UPDATE `users` SET `commentedclass` = '1#', `commentedid` = '1#', `bycommented` = '3#', `updated_at` = '2017-05-22 20:21:04' WHERE `users`.`id` = 1
---
  def comm
    unless params[:comment][:message].blank? then
      ccc = Comment.new
      ccc.courseid = params[:id].to_i
      ccc.usersid = current_user.id
      ccc.message = params[:comment][:message]
      ccc.year = params[:comment][:year]
      ccc.typos = params[:comment][:typos]
      ccc.bycommented = Course.find(params[:id]).pv.to_i

      ccc.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3  ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `likedclass` = '1#', `updated_at` = '2017-05-23 00:44:34' WHERE `users`.`id` = 3
SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 3 LIMIT 1
UPDATE `courses` SET `likedby` = '1,', `updated_at` = '2017-06-17 07:18:38' WHERE `courses`.`id` = 1
---
  def like
    @usrs = User.find(current_user.id)

    unless @usrs.likedclass.blank?
      @likedornot = @usrs.likedclass.split("#").find{ |ids| ids.to_i ==   params[:id].to_i }
    else
      @likedornot ={}
    end

    if @likedornot.blank?
      @usrs.likedclass = @usrs.likedclass.to_s + params[:id]  + '#'
      @usrs.save

      @courses = Course.find(params[:id])
      @courses.likedby =  @courses.likedby.to_s + current_user.id.to_s + ","
      @courses.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `likedclass` = '3#', `updated_at` = '2017-06-17 07:18:27' WHERE `users`.`id` = 1
SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
UPDATE `courses` SET `likedby` = '', `updated_at` = '2017-06-17 07:36:14' WHERE `courses`.`id` = 1
---
  def dislike
    @usrs = User.find(current_user.id)



    @usrs.likedclass = ("#" + @usrs.likedclass).gsub("#"+params[:id].to_s+"#", "#")
    @usrs.likedclass.slice!(0)
    @usrs.save

    @courses = Course.find(params[:id])
    @courses.likedby = ("," + @courses.likedby).gsub(","+current_user.id.to_s+",", ",")
    @courses.likedby.slice!(0)
    @courses.save

INSERT INTO `courses` (`coursename`, `teacher`, `credits`, `duration`, `weekday`, `code`, `dept`, `creator`, `created_at`, `updated_at`) VALUES ('テスト講義', '山田太郎', 2, '前期', '月1', '', '経済', 1, '2017-05-22 18:40:37', '2017-05-22 18:40:37')
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `courses`.* FROM `courses`  ORDER BY `courses`.`id` DESC LIMIT 1
UPDATE `users` SET `createdclass` = '1#', `updated_at` = '2017-05-22 18:40:37' WHERE `users`.`id` = 1
---
  def create
    @course = Course.new(course_params)
    @course.creator = current_user.id
    respond_to do |format|
      if @course.save
        @usrs = User.find(current_user.id)
        @usrs.createdclass = @usrs.createdclass.to_s + Course.last.id.to_s+ '#'
        @usrs.save

SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
---
    def set_course
      @course = Course.find(params[:id])