app/controllers/mypage_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1
---
  def index
    @usrs = User.find(current_user.id)
    @likeds ={}
    @commenteds ={}
    @createds ={}
    unless @usrs.likedclass.blank?
      @likeds = @usrs.likedclass.split('#')
    end
    unless @usrs.commentedid.blank?

SELECT DISTINCT COUNT(DISTINCT `courses`.`id`) FROM `courses`
---
  def result
    #@products = Product.all
    @q   = Course.search(params[:q])
    @res = @q.result(distinct: true).page(params[:page]).per(1)