app/views/inquiry/index.html.haml


- if User.find(current_user.id).admin?
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1