app/views/mypage/index.html.haml

              .alert.alert-warning
                -@aaa = Course.find(a.to_i)
                .col-xs-12.coursename #{@aaa.coursename.truncate(11)}
                .col-xs-6 - #{@aaa.teacher.truncate(8)}
                .col-xs-6  コメント (#{Comment.where(courseid: a.to_i).count})
                .clear
---
SELECT COUNT(*) FROM `comments` WHERE `comments`.`courseid` = 1

              .alert.alert-info
                - @ccou = Course.find(c.to_i)
                .col-xs-12.coursename #{@ccou.coursename.truncate(11)}
                .col-xs-6 - #{@ccou.teacher.truncate(8)}
                .col-xs-6  閲覧数: #{@ccou.pv}
                .clear
---
SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1

          .eachcommenteds.eachelem
            - @comfind = Comment.find(b.to_i)
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1