app/views/mypage/result.html.haml

SELECT  `ratings`.* FROM `ratings` WHERE `ratings`.`courseid` = 1 LIMIT 1
---
  - @res.each do |a|
    - rats = Rating.find_by(courseid:a.id)